// ================================================================================================
// Runner Module: Plain Text
// ================================================================================================

// ----------------------------------------------------------------
// imports
// ----------------------------------------------------------------

import type { Runner, RunnerResult } from "../types";

// ----------------------------------------------------------------
// types
// ----------------------------------------------------------------

/** PlaintextのRunnerに必要なRunnerContext。現時点では空。 */
type PlaintextRunnerContext = {};

// ----------------------------------------------------------------
// init()
// コード実行に必要な初期化処理を行い、Contextを返す。
// ----------------------------------------------------------------

export const init = async (): Promise<PlaintextRunnerContext> => {
    return {};
};

// ----------------------------------------------------------------
// run()
// Contextを用いてコードを実行し、結果を返す。
// ----------------------------------------------------------------

export const run: Runner<PlaintextRunnerContext> = async (
    { code },
) => {
    // ==== Plain Textは実行しないので、そのままstdoutにコードを返す ====
    const result: Awaited<RunnerResult> = {
        status: "success",
        data: {
            stdout: code,
            stderr: "",
        },
    };
    return result;
};

// ----------------------------------------------------------------
// export
// ----------------------------------------------------------------
export default { init, run };
