// ================================================================================================
// Runner Module: Python (Firefox ver.)
// FirefoxではBackground Script内でPyodideが動かせるので、そうします
// ================================================================================================

// ----------------------------------------------------------------
// imports
// ----------------------------------------------------------------

import type { PyodideInterface } from "pyodide";
import type { Runner, RunnerResult } from "../types";

// ----------------------------------------------------------------
// types
// ----------------------------------------------------------------

/** PythonのRunnerに必要なRunnerContext */
type PythonRunnerContext = {
    pyodideInterfaceID: string;
};

// ----------------------------------------------------------------
// Implementation
// ----------------------------------------------------------------

/** (Firefox限定) PyodideのInterfaceを保存するMap */
const pyodideMap = new Map<string, PyodideInterface>();

// ----------------------------------------------------------------
// init()
// コード実行に必要な初期化処理を行い、Contextを返す。
// ----------------------------------------------------------------

export const init = async (): Promise<PythonRunnerContext> => {
    // TODO: Implementation
};

// ----------------------------------------------------------------
// run()
// Contextを用いてコードを実行し、結果を返す。
// ----------------------------------------------------------------

export const run: Runner<PythonRunnerContext> = async (
    { context, code, stdin },
) => {
    // TODO: Implementation
};

// ----------------------------------------------------------------
// export
// ----------------------------------------------------------------
export default { init, run };
